In [3]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Table Practice Exercises ##

## Load tables: ##

In [12]:
galton = Table.read_table('galton.csv')
galton

family | father | mother | midparentHeight | children | childNum | gender | childHeight
1      | 78.5   | 67     | 75.43           | 4        | 1        | male   | 73.2
1      | 78.5   | 67     | 75.43           | 4        | 2        | female | 69.2
1      | 78.5   | 67     | 75.43           | 4        | 3        | female | 69
1      | 78.5   | 67     | 75.43           | 4        | 4        | female | 69
2      | 75.5   | 66.5   | 73.66           | 4        | 1        | male   | 73.5
2      | 75.5   | 66.5   | 73.66           | 4        | 2        | male   | 72.5
2      | 75.5   | 66.5   | 73.66           | 4        | 3        | female | 65.5
2      | 75.5   | 66.5   | 73.66           | 4        | 4        | female | 65.5
3      | 75     | 64     | 72.06           | 2        | 1        | male   | 71
3      | 75     | 64     | 72.06           | 2        | 2        | female | 68
... (924 rows omitted)

In [4]:
cones = Table.read_table('cones.csv')
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [44]:
survey = Table.read_table('welcome_survey_v3.csv')
survey

Year            | Extraversion | Number of Texters | Hours of Sleep | Handedness   | Sleep Side
First           | 2            | 6                 | 8              | Ambidextrous |  back
First           | 7            | 10                | 7              | Ambidextrous |  stomach
Second          | 4            | 5                 | 7              | Ambidextrous |  left side
Third           | 6            | 8                 | 7              | Ambidextrous |  back
Fourth or above | 3            | 4                 | 7              | Ambidextrous |  right side
Second          | 3            | 10                | 6              | Ambidextrous |  left side
Second          | 1            | 3                 | 3              | Ambidextrous |  back
Third           | 2            | 4                 | 6              | Ambidextrous |  stomach
Fourth or above | 8            | 3                 | 6              | Left-handed  |  left side
Fourth or above | 3            | 3                 | 6              | Left-handed  |  right side
... (1234 rows omitted)

In [5]:
top_movies = Table.read_table('top_movies_2017.csv')
top_movies

Title                            | Studio          | Gross     | Gross (Adjusted) | Year
Gone with the Wind               | MGM             | 198676459 | 1796176700       | 1939
Star Wars                        | Fox             | 460998007 | 1583483200       | 1977
The Sound of Music               | Fox             | 158671368 | 1266072700       | 1965
E.T.: The Extra-Terrestrial      | Universal       | 435110554 | 1261085000       | 1982
Titanic                          | Paramount       | 658672302 | 1204368000       | 1997
The Ten Commandments             | Paramount       | 65500000  | 1164590000       | 1956
Jaws                             | Universal       | 260000000 | 1138620700       | 1975
Doctor Zhivago                   | MGM             | 111721910 | 1103564200       | 1965
The Exorcist                     | Warner Brothers | 232906145 | 983226600        | 1973
Snow White and the Seven Dwarves | Disney          | 184925486 | 969010000        | 1937
... (190 rows omitted)

In [7]:
actors = Table.read_table('actors.csv')
actors

Actor              | Total Gross | Number of Movies | Average per Movie | #1 Movie                     | Gross
Harrison Ford      | 4871.7      | 41               | 118.8             | Star Wars: The Force Awakens | 936.7
Samuel L. Jackson  | 4772.8      | 69               | 69.2              | The Avengers                 | 623.4
Morgan Freeman     | 4468.3      | 61               | 73.3              | The Dark Knight              | 534.9
Tom Hanks          | 4340.8      | 44               | 98.7              | Toy Story 3                  | 415
Robert Downey, Jr. | 3947.3      | 53               | 74.5              | The Avengers                 | 623.4
Eddie Murphy       | 3810.4      | 38               | 100.3             | Shrek 2                      | 441.2
Tom Cruise         | 3587.2      | 36               | 99.6              | War of the Worlds            | 234.3
Johnny Depp        | 3368.6      | 45               | 74.9              | Dead Man's Chest             | 423.3
Michael Caine      | 3351.5      | 58               | 57.8              | The Dark Knight              | 534.9
Scarlett Johansson | 3341.2      | 37               | 90.3              | The Avengers                 | 623.4
... (40 rows omitted)

In [13]:
nba = Table.read_table('nba_salaries.csv')
nba = nba.relabeled(3, 'SALARY')
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

## Exercises##

Exercise 0: (Example problem) From the `top_movies` table, find the average adjusted gross earnings of each studio's top movies, sorted from highest to lowest.

In [10]:
# Solution to Exercise 0 (Example problem)
avg_earnings = top_movies.select('Studio', 'Gross (Adjusted)').group('Studio', np.average)
avg_earnings.set_format(1, NumberFormatter)
avg_earnings.sort(1, descending = True)

Studio         | Gross (Adjusted) average
MGM            | 788,230,557.14
AVCO           | 760,778,000.00
Disney         | 646,036,036.36
Fox            | 622,679,616.67
Universal      | 539,891,995.65
RKO            | 537,719,200.00
Paramount      | 531,931,388.00
NM             | 530,776,000.00
United Artists | 528,886,800.00
Sony           | 518,230,225.00
... (13 rows omitted)